{
  "backend/main.mo": "Minimal Motoko canister entry point defining an empty actor with no methods or state.",
  "feature_evidence.json": "Feature evidence report documenting a completed update to make decorative heart icons fully transparent, with high confidence and referenced components.",
  "frontend-file-summaries.txt": "Prewritten high-level summaries of all frontend source files and assets used for build planning and documentation.",
  "frontend/index.css": "Global Tailwind CSS base layer defining OKLCH design tokens, light/dark theme variables, and base body and border styles.",
  "frontend/index.html": "HTML entry document that sets metadata, page title, and mounts the React app to the root div.",
  "frontend/src/App.tsx": "Root React component that conditionally renders the Valentine question gate or the main Valentine page based on user interaction state.",
  "frontend/src/components/valentine/PlayfulNoButton.tsx": "Interactive \"No\" button that evades the cursor or touch, changes label based on attempts, and becomes clickable after several tries.",
  "frontend/src/components/valentine/SectionShell.tsx": "Reusable layout wrapper that constrains content width and applies consistent horizontal padding using Tailwind utilities.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches a backend actor based on Internet Identity state and invalidates dependent React Query queries on change.",
  "frontend/src/hooks/useAvoidingButtonPosition.ts": "Hook that computes safe random on-screen positions to move a button away from its current location while staying within viewport bounds.",
  "frontend/src/hooks/useInternetIdentity.ts": "Comprehensive authentication context and provider for Internet Identity, managing login state, identity persistence, and AuthClient setup.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder module indicating no backend data queries are required for this static Valentine application.",
  "frontend/src/index.css": "Extended global styles defining a romantic rose-and-cream color palette, typography, dark mode variants, and animation utilities.",
  "frontend/src/lib/utils.ts": "Utility helper that merges conditional class names using clsx and resolves Tailwind conflicts with tailwind-merge.",
  "frontend/src/lib/valentineCopy.ts": "Centralized copy module exporting the recipient name constant used throughout the Valentine app.",
  "frontend/src/main.tsx": "React application entry point that initializes React Query, Internet Identity provider, global styles, and renders the App component.",
  "frontend/src/pages/ValentinePage.tsx": "Renders the main Valentine page with a full-screen romantic background, hero section, and a heartfelt letter personalized using RECIPIENT_NAME. Uses SectionShell, decorative images, lucide-react hearts, and Tailwind styling for responsive, animated presentation.",
  "frontend/src/pages/ValentineQuestionGatePage.tsx": "Implements the initial Valentine question gate asking \"Will you be my Valentine?\" with themed decorations and Yes/No interactions. The Yes button and a playful evasive No button both trigger the onAnswer callback to proceed.",
  "frontend/tailwind.config.js": "Defines the Tailwind CSS configuration with dark mode, content paths, plugins, and extensive theme extensions. Includes OKLCH-based color tokens (notably rose/cream), custom fonts, container settings, and radius scales for the romantic design system.",
  "project_state.json": "Captures the structured project state and feature inventory for the Valentine app, including frontend, styling, and backend scaffold details. Documents existing features, versions, and a high-level summary of the personalized Valentine experience."
}